Tekla.Structures.ModelInternal.GeometryImporter
GeometryImporter class provides tools to import part geometry.

Tekla.Structures.ModelInternal.GeometryImporter.ParentOfTheRoot
The value used in place of parent index for the root section

Tekla.Structures.ModelInternal.GeometryImporter.ImportGeometry(Tekla.Structures.Model.ConnectiveGeometry@)
Imports the geometry from core
connectiveGeometry: The geometry tree imported from core
Returns: true if successful

Tekla.Structures.ModelInternal.GeometryImporter.ImportFlatGeometry(Tekla.Structures.ModelInternal.PointList,Tekla.Structures.ModelInternal.IntList,System.Int32,System.Int32,System.Int32,Tekla.Structures.Geometry3d.Matrix,System.Boolean)
Imports the flat geometry section.
pointList: The points list.
intList: The ints list.
pointsCount: The points number to retrive.
pointCurrentIndex: The current index int the point list.
intCurrentIndex: The current index in the int list.
matrixToCurrent: The matrix to transform global coordinates to current coordinates.
isAutomatic: true if the geometry section is an automatically generated extension.
Returns: The geometry section node.

Tekla.Structures.ModelInternal.GeometryImporter.ImportBendSurfaceGeometry(Tekla.Structures.ModelInternal.PointList,System.Int32,System.Int32,System.Int32,Tekla.Structures.Geometry3d.Matrix)
Imports the bend surface geometry section.
pointList: The points list.
pointsCount1: Number of points in the first lateral boundary.
pointsCount2: Number of points in the second lateral boundary.
pointIndex: The index of the first processed point.
matrixToCurrent: The matrix to transform global coordinates to current coordinates.
Returns: The geometry section node.

Tekla.Structures.ModelInternal.GeometryImporter.ImportHelixGeometry(Tekla.Structures.ModelInternal.PointList,System.Int32,Tekla.Structures.Geometry3d.Matrix)
Imports the helix geometry section.
pointList: The points list.
pointIndex: The index of the first processed point.
matrixToCurrent: The matrix to transform global coordinates to current coordinates.
Returns: The geometry section node.